In [2]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
import pandas as pd
import numpy as np

# 판다스의 문자열 처리

데이타프레임[컬럼명].str.함수명()
<br>
데이타프레임[컬럼명].inin()

In [11]:
# tsv파일은 Tabl을 기본으로 설정되어 있으므로 Seperate \t를 통해서 불러온다.
df_gap = pd.read_csv('data/gapminder.tsv', sep='\t')

In [12]:
df_gap.sample(5)

          country continent  year  lifeExp       pop     gdpPercap
935        Malawi    Africa  2007   48.303  13327079    759.349910
1246     Portugal    Europe  2002   77.290  10433867  19970.907870
1252  Puerto Rico  Americas  1972   72.160   2847132   9123.041742
941      Malaysia      Asia  1977   65.256  12845381   3827.921571
1534     Thailand      Asia  2002   68.564  62806748   5913.187529

##### korea, KOREA 글자가 들어간 데이타를 추출하려면?

In [10]:
# 국가 목록 
df_gap['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [16]:
# 'Korea, Dem. Rep.' , 'Korea, Rep.' 국가의 데이타만 출력 
df_gap[(df_gap['country'] == 'Korea, Dem. Rep.') | (df_gap['country'] == 'Korea, Rep.')].head()

              country continent  year  lifeExp       pop    gdpPercap
828  Korea, Dem. Rep.      Asia  1952   50.056   8865488  1088.277758
829  Korea, Dem. Rep.      Asia  1957   54.081   9411381  1571.134655
830  Korea, Dem. Rep.      Asia  1962   56.656  10917494  1621.693598
831  Korea, Dem. Rep.      Asia  1967   59.942  12617009  2143.540609
832  Korea, Dem. Rep.      Asia  1972   63.983  14781241  3701.621503

In [17]:
# 데이타프레임[컬럼명].isin([값1, 값2 ...])
df_gap['country'].isin(['Korea, Dem. Rep.', 'Korea, Rep.']).head()

0    False
1    False
2    False
3    False
4    False
Name: country, dtype: bool

In [18]:
df_gap[df_gap['country'].isin(['Korea, Dem. Rep.', 'Korea, Rep.'])].head()

              country continent  year  lifeExp       pop    gdpPercap
828  Korea, Dem. Rep.      Asia  1952   50.056   8865488  1088.277758
829  Korea, Dem. Rep.      Asia  1957   54.081   9411381  1571.134655
830  Korea, Dem. Rep.      Asia  1962   56.656  10917494  1621.693598
831  Korea, Dem. Rep.      Asia  1967   59.942  12617009  2143.540609
832  Korea, Dem. Rep.      Asia  1972   63.983  14781241  3701.621503

In [19]:
df_gap[(df_gap['country'] == 'Korea, Dem. Rep.') | (df_gap['country'] == 'Korea, Rep.')].count()

country      24
continent    24
year         24
lifeExp      24
pop          24
gdpPercap    24
dtype: int64

In [20]:
df_gap[df_gap['country'].isin(['Korea, Dem. Rep.', 'Korea, Rep.'])].count()

country      24
continent    24
year         24
lifeExp      24
pop          24
gdpPercap    24
dtype: int64

In [22]:
# 모두 소문자로 출력
# 모두 대문자로 출력은 str.upper()
df_gap['country'].str.lower()

0       afghanistan
1       afghanistan
2       afghanistan
3       afghanistan
4       afghanistan
           ...
1699       zimbabwe
1700       zimbabwe
1701       zimbabwe
1702       zimbabwe
1703       zimbabwe
Name: country, Length: 1704, dtype: object

In [23]:
# 첫번째 글자만 출력 
df_gap['country'].str[0]

0       A
1       A
2       A
3       A
4       A
       ..
1699    Z
1700    Z
1701    Z
1702    Z
1703    Z
Name: country, Length: 1704, dtype: object

In [24]:
# 5개의 글자만 추출 
df_gap['country'].str[:5]

0       Afgha
1       Afgha
2       Afgha
3       Afgha
4       Afgha
        ...
1699    Zimba
1700    Zimba
1701    Zimba
1702    Zimba
1703    Zimba
Name: country, Length: 1704, dtype: object

In [25]:
# Korea 가 들어간 데이타?
df_gap[df_gap['country'].str.contains('Korea')]

              country continent  year  lifeExp       pop     gdpPercap
828  Korea, Dem. Rep.      Asia  1952   50.056   8865488   1088.277758
829  Korea, Dem. Rep.      Asia  1957   54.081   9411381   1571.134655
830  Korea, Dem. Rep.      Asia  1962   56.656  10917494   1621.693598
831  Korea, Dem. Rep.      Asia  1967   59.942  12617009   2143.540609
832  Korea, Dem. Rep.      Asia  1972   63.983  14781241   3701.621503
833  Korea, Dem. Rep.      Asia  1977   67.159  16325320   4106.301249
834  Korea, Dem. Rep.      Asia  1982   69.100  17647518   4106.525293
835  Korea, Dem. Rep.      Asia  1987   70.647  19067554   4106.492315
836  Korea, Dem. Rep.      Asia  1992   69.978  20711375   3726.063507
837  Korea, Dem. Rep.      Asia  1997   67.727  21585105   1690.756814
838  Korea, Dem. Rep.      Asia  2002   66.662  22215365   1646.758151
839  Korea, Dem. Rep.      Asia  2007   67.297  23301725   1593.065480
840       Korea, Rep.      Asia  1952   47.453  20947571   1030.592226
841       Korea, Rep.      Asia  1957   52.681  22611552   1487.593537
842       Korea, Rep.      Asia  1962   55.292  26420307   1536.344387
843       Korea, Rep.      Asia  1967   57.716  30131000   2029.228142
844       Korea, Rep.      Asia  1972   62.612  33505000   3030.876650
845       Korea, Rep.      Asia  1977   64.766  36436000   4657.221020
846       Korea, Rep.      Asia  1982   67.123  39326000   5622.942464
847       Korea, Rep.      Asia  1987   69.810  41622000   8533.088805
848       Korea, Rep.      Asia  1992   72.244  43805450  12104.278720
849       Korea, Rep.      Asia  1997   74.647  46173816  15993.527960
850       Korea, Rep.      Asia  2002   77.045  47969150  19233.988180
851       Korea, Rep.      Asia  2007   78.623  49044790  23348.139730

In [26]:
# land 들어간 나라의 데이타 출력?
df_gap[df_gap['country'].str.contains('land')]

       country continent  year  lifeExp       pop     gdpPercap
516    Finland    Europe  1952   66.550   4090500   6424.519071
517    Finland    Europe  1957   67.490   4324000   7545.415386
518    Finland    Europe  1962   68.750   4491443   9371.842561
519    Finland    Europe  1967   69.830   4605744  10921.636260
520    Finland    Europe  1972   70.870   4639657  14358.875900
...        ...       ...   ...      ...       ...           ...
1531  Thailand      Asia  1987   66.084  52910342   2982.653773
1532  Thailand      Asia  1992   67.298  56667095   4616.896545
1533  Thailand      Asia  1997   67.521  60216677   5852.625497
1534  Thailand      Asia  2002   68.564  62806748   5913.187529
1535  Thailand      Asia  2007   70.616  65068149   7458.396327

[108 rows x 6 columns]

In [31]:
# Land가 들어간 Country 컬럼의 Unique 값 
df_gap[df_gap['country'].str.contains('land')]['country'].unique()

array(['Finland', 'Iceland', 'Ireland', 'Netherlands', 'New Zealand',
       'Poland', 'Swaziland', 'Switzerland', 'Thailand'], dtype=object)

In [27]:
# land, an 글자가 들어간 데이타 목록 
df_gap[df_gap['country'].str.contains('land|an')]

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
1            Afghanistan      Asia  1957   30.332   9240934   820.853030
2            Afghanistan      Asia  1962   31.997  10267083   853.100710
3            Afghanistan      Asia  1967   34.020  11537966   836.197138
4            Afghanistan      Asia  1972   36.088  13079460   739.981106
...                  ...       ...   ...      ...       ...          ...
1663  West Bank and Gaza      Asia  1987   67.046   1691210  5107.197384
1664  West Bank and Gaza      Asia  1992   69.718   2104779  6017.654756
1665  West Bank and Gaza      Asia  1997   71.096   2826046  7110.667619
1666  West Bank and Gaza      Asia  2002   72.370   3389578  4515.487575
1667  West Bank and Gaza      Asia  2007   73.422   4018332  3025.349798

[468 rows x 6 columns]

In [28]:
df_gap[df_gap['country'].str.contains('land|an')]['country'].unique()

array(['Afghanistan', 'Albania', 'Bangladesh', 'Bosnia and Herzegovina',
       'Botswana', 'Canada', 'Central African Republic',
       'Dominican Republic', 'Finland', 'France', 'Germany', 'Ghana',
       'Iceland', 'Iran', 'Ireland', 'Japan', 'Jordan', 'Lebanon',
       'Mauritania', 'Myanmar', 'Netherlands', 'New Zealand', 'Oman',
       'Pakistan', 'Panama', 'Poland', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Sri Lanka', 'Sudan', 'Swaziland',
       'Switzerland', 'Taiwan', 'Tanzania', 'Thailand',
       'Trinidad and Tobago', 'Uganda', 'West Bank and Gaza'],
      dtype=object)

In [29]:
# land, an이 들어간 Country 컬럼의 unique값의 수 
len(df_gap[df_gap['country'].str.contains('land|an')]['country'].unique())

39

In [30]:
# 마스킹해보기 
df_gap['country'].str[:3] + '*******'
# 마스킹 한 값 country2로 컬럼 저장하기 
df_gap['country2'] = df_gap['country'].str[:3] + '*******'

0       Afg*******
1       Afg*******
2       Afg*******
3       Afg*******
4       Afg*******
           ...
1699    Zim*******
1700    Zim*******
1701    Zim*******
1702    Zim*******
1703    Zim*******
Name: country, Length: 1704, dtype: object

In [32]:
df_gap.sample(5)

           country continent  year  lifeExp       pop    gdpPercap    country2
343    Congo, Rep.    Africa  1987   57.470   2064095  4201.194937  Con*******
1406  South Africa    Africa  1962   49.951  18356657  5768.729717  Sou*******
450        Ecuador  Americas  1982   64.342   8365850  7213.791267  Ecu*******
1023       Morocco    Africa  1967   50.335  14770296  1711.044770  Mor*******
642          Haiti  Americas  1982   51.461   5198399  2011.159549  Hai*******

# 데이타프레임 결과 csv 저장하기 

데이타프레임.to_csv(fileURL, index=False, encoding='utf-8/cp949') <br>
index=False 인덱스 없이 저장

In [33]:
# 필요한 컬럼만 저장하기  
# index = False 인덱스 제거하기 
df_gap[['country', 'year', 'pop']].to_csv('data/df_gap1.csv', index=False)

In [35]:
ls data

 C ����̺��� �������� �̸��� �����ϴ�.
 ���� �Ϸ� ��ȣ: E070-A7AC

 c:\Users\TFG5076XG\git\SKplanet_Tacademy\Pandas\data ���͸�

2022-05-02  ���� 10:48    <DIR>          .
2022-05-02  ���� 10:49    <DIR>          ..
2021-11-23  ���� 12:12             3,088 births.txt
2022-05-02  ���� 10:48            40,508 df_gap1.csv
2022-05-02  ���� 10:42            81,932 gapminder.tsv
2021-11-23  ���� 12:25            35,455 Jeju2021.csv
2016-07-17  ���� 09:46           171,308 movies.dat
2018-04-24  ���� 10:42        24,594,131 ratings.dat
2019-03-20  ���� 10:54         1,185,149 seoul.csv
2021-01-31  ���� 08:49            93,805 seoul2021.csv
2021-11-26  ���� 02:11            97,152 seoul-covid19_6_30_.csv
2021-11-26  ���� 02:11            93,517 ���µ�_����202012.csv
2021-12-02  ���� 05:51           149,504 ���������.xls
2021-11-26  ���� 02:11             2,163 ���� ��� �о簡��.csv
              12�� ����          26,547,712 ����Ʈ
               2�� ���͸�  178,011,435,008 ����Ʈ ����

# 결측값 처리

```
np.nan : 넘파이 결측값 
NaN = Not A Number 

isnull() : 결측값이 있는 경우 True
notnull() : 결측값이 없는 경우 True

시리즈변수.isnull()
데이터프레임[컬럼명].isnull()
isnull().sum(), isnull().count() 결측값의 갯수

결측값이 있는 데이터 조회
데이터프레임.loc[데이터프레임.isnull()[NaN값이 있는 열], :]
```

In [3]:
# 결측값이 있는 시리즈 생성
s1 = pd.Series([np.nan, 10, 200, np.nan, -7, np.nan, 0])
s1

0      NaN
1     10.0
2    200.0
3      NaN
4     -7.0
5      NaN
6      0.0
dtype: float64

In [4]:
# isnull()은 NaN은 True를 반환
s1.isnull()

0     True
1    False
2    False
3     True
4    False
5     True
6    False
dtype: bool

In [5]:
# notnull()은 NaN = False
s1.notnull()

0    False
1     True
2     True
3    False
4     True
5    False
6     True
dtype: bool

In [6]:
# 결측치의 갯수는? True = 1로써 3개
s1.isnull().sum()

3

In [7]:
# NaN이 아닌 값은 총 4개
s1.notnull().sum()

4

In [8]:
# 결측값이 있는 데이타프레임 생성 
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
# 결측치값 강제 생성
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col4'] = np.nan
df.iloc[1,2] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   NaN   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5  17.0  18.0  19.0   NaN

In [9]:
# 결측치가 있는 데이타는 True
df.isnull()
# 반대는 
df.notnull()

       col1   col2   col3   col4
row1   True  False   True   True
row2   True   True  False   True
row3   True   True   True   True
row4  False   True   True   True
row5   True   True   True  False

In [10]:
# 각 컬럼별로 결측치의 계수가 나온다.
df.isnull().sum()

col1    1
col2    1
col3    1
col4    1
dtype: int64

In [11]:
#결측치가 있는 데이타 조회 
df.loc[df.isnull()['col1'], :]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

In [12]:
# 결측치가 있는 데이타 조회 
df.loc[df.isnull()['col1'], :]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

In [13]:
df[df.isnull()['col1']]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

In [14]:
# 결측값이 있는 데이타프레임 생성 
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
# 결측치값 강제 생성
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col4'] = np.nan
df.iloc[1,2] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   NaN   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5  17.0  18.0  19.0   NaN

In [15]:
# 결측치가 있는 데이타는 True
df.isnull()
# 반대는 
df.notnull()

       col1   col2   col3   col4
row1   True  False   True   True
row2   True   True  False   True
row3   True   True   True   True
row4  False   True   True   True
row5   True   True   True  False

In [16]:
# 각 컬럼별로 결측치의 계수가 나온다.
df.isnull().sum()

col1    1
col2    1
col3    1
col4    1
dtype: int64

In [17]:
#결측치가 있는 데이타 조회 
df.loc[df.isnull()['col1'], :]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

In [18]:
# 결측치가 있는 데이타 조회 
df.loc[df.isnull()['col1'], :]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

In [19]:
df[df.isnull()['col1']]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

# NaN 값이 들어있는 행 삭제하기
- 데이타프레임이름.dropna(how="any") : 결측값이 하나라도 있다면 삭제 
- 데이타프레임이름.dropna(how="all") : 결측값이 모두 있다면 삭제

In [20]:
# 결측값이 있는 데이타프레임 생성 
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col1'] = np.nan
df.loc['row5','col2'] = np.nan
df.loc['row5','col3'] = np.nan
df.loc['row5','col4'] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [21]:
# 하나라도 결측치가 있다면 삭제 
df.dropna(how ='any')

      col1  col2  col3  col4
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0

# NaN 값이 들어있는 행 삭제하기
- 데이타프레임이름.dropna(how="any",  inplace=False/True) : 결측값이 하나라도 있다면 삭제 
- 데이타프레임이름.dropna(how="all",  inplace=False/True) : 결측값이 모두 있다면 삭제

In [22]:
# 모든 행의 값이 결측치
df.dropna(how="all", inplace=True)

# NaN값에 특정 값 입력하기

데이타프레임이름.fillna(value=값)

In [23]:
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col1'] = np.nan
df.loc['row5','col2'] = np.nan
df.loc['row5','col3'] = np.nan
df.loc['row5','col4'] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [24]:
df.fillna(0)

      col1  col2  col3  col4
row1   1.0   0.0   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   0.0  14.0  15.0  16.0
row5   0.0   0.0   0.0   0.0

In [25]:
# 평균값으로 결측치 채우기 
df.fillna(df.mean(), inplace=True)